data/collected_data/orange/api/standardb12ms/f/load_compose.txt
Running 30m test @ http://20.108.19.134:60/wrk2-api/post/compose
  2 threads and 1000 connections
  Thread calibration: mean lat.: 731.282ms, rate sampling interval: 3809ms
  Thread calibration: mean lat.: 624.947ms, rate sampling interval: 2752ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     5.29m     3.20m   11.80m    59.73%
    Req/Sec   317.26     25.44   368.00     73.95%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.12m 
 75.000%    7.89m 
 90.000%    9.74m 
 99.000%   11.80m 
 99.900%   12.88m 
 99.990%   13.52m 
 99.999%   14.64m 
100.000%   14.84m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      17.007     0.000000            1         1.00
   64290.815     0.100000       113747         1.11
  123076.607     0.200000       227447         1.25
  182190.079     0.300000       341108         1.43
  243662.847     0.400000       454887         1.67
  306970.623     0.500000       568499         2.00
  339214.335     0.550000       625626         2.22
  372768.767     0.600000       682526         2.50
  405798.911     0.650000       739239         2.86
  439091.199     0.700000       796051         3.33
  473169.919     0.750000       853077         4.00
  491519.999     0.775000       881318         4.44
  508297.215     0.800000       909781         5.00
  526647.295     0.825000       938303         5.71
  545259.519     0.850000       967154         6.67
  564133.887     0.875000       995208         8.00
  574095.359     0.887500      1009310         8.89
  584581.119     0.900000      1023569        10.00
  596115.455     0.912500      1037845        11.43
  608698.367     0.925000      1052069        13.33
  621805.567     0.937500      1066307        16.00
  628621.311     0.943750      1073267        17.78
  635437.055     0.950000      1080226        20.00
  642777.087     0.956250      1087313        22.86
  651689.983     0.962500      1094603        26.67
  661651.455     0.968750      1101659        32.00
  666894.335     0.971875      1105203        35.56
  672137.215     0.975000      1108644        40.00
  677904.383     0.978125      1112176        45.71
  684195.839     0.981250      1115854        53.33
  691535.871     0.984375      1119401        64.00
  695205.887     0.985938      1120990        71.11
  699924.479     0.987500      1122907        80.00
  704643.071     0.989062      1124676        91.43
  709885.951     0.990625      1126381       106.67
  716177.407     0.992188      1128140       128.00
  719323.135     0.992969      1128989       142.22
  722993.151     0.993750      1129910       160.00
  727711.743     0.994531      1130802       182.86
  732430.335     0.995313      1131655       213.33
  737673.215     0.996094      1132582       256.00
  740294.655     0.996484      1132978       284.44
  743964.671     0.996875      1133443       320.00
  748158.975     0.997266      1133901       365.71
  752353.279     0.997656      1134320       426.67
  756547.583     0.998047      1134758       512.00
  759169.023     0.998242      1134977       568.89
  762314.751     0.998437      1135220       640.00
  764936.191     0.998633      1135421       731.43
  768606.207     0.998828      1135643       853.33
  773324.799     0.999023      1135877      1024.00
  775946.239     0.999121      1135991      1137.78
  778567.679     0.999219      1136114      1280.00
  780664.831     0.999316      1136208      1462.86
  783286.271     0.999414      1136315      1706.67
  786956.287     0.999512      1136419      2048.00
  789053.439     0.999561      1136483      2275.56
  790626.303     0.999609      1136531      2560.00
  792723.455     0.999658      1136596      2925.71
  795344.895     0.999707      1136652      3413.33
  797442.047     0.999756      1136702      4096.00
  799014.911     0.999780      1136733      4551.11
  800063.487     0.999805      1136752      5120.00
  802160.639     0.999829      1136786      5851.43
  804257.791     0.999854      1136808      6826.67
  807403.519     0.999878      1136840      8192.00
  809500.671     0.999890      1136854      9102.22
  812122.111     0.999902      1136864     10240.00
  816840.703     0.999915      1136877     11702.86
  821559.295     0.999927      1136893     13653.33
  825753.599     0.999939      1136905     16384.00
  832045.055     0.999945      1136913     18204.44
  834666.495     0.999951      1136920     20480.00
  837287.935     0.999957      1136927     23405.71
  842530.815     0.999963      1136937     27306.67
  844103.679     0.999969      1136940     32768.00
  849870.847     0.999973      1136943     36408.89
  853016.575     0.999976      1136947     40960.00
  869793.791     0.999979      1136953     46811.43
  870318.079     0.999982      1136954     54613.33
  870842.367     0.999985      1136957     65536.00
  872939.519     0.999986      1136959     72817.78
  875560.959     0.999988      1136961     81920.00
  877658.111     0.999989      1136962     93622.86
  879755.263     0.999991      1136964    109226.67
  880803.839     0.999992      1136966    131072.00
  883949.567     0.999993      1136967    145635.56
  885522.431     0.999994      1136969    163840.00
  885522.431     0.999995      1136969    187245.71
  885522.431     0.999995      1136969    218453.33
  887095.295     0.999996      1136970    262144.00
  887619.583     0.999997      1136971    291271.11
  887619.583     0.999997      1136971    327680.00
  887619.583     0.999997      1136971    374491.43
  889192.447     0.999998      1136972    436906.67
  889192.447     0.999998      1136972    524288.00
  890241.023     0.999998      1136974    582542.22
  890241.023     1.000000      1136974          inf
#[Mean    =   317487.930, StdDeviation   =   191762.898]
#[Max     =   889716.736, Total count    =      1136974]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1143275 requests in 30.00m, 229.47MB read
  Socket errors: connect 0, read 1879, write 87531, timeout 121904
  Non-2xx or 3xx responses: 109364
Requests/sec:    635.15
Transfer/sec:    130.54KB